app/controllers/api/users_controller.rb

    def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "heriasdasd"], ["created_at", "2019-08-28 23:30:44.035795"], ["updated_at", "2019-08-28 23:30:44.035795"]]